joe-hung/ME446_repo/C2000Ware_4_01_00_00/device_support/f2833x/examples/f28335_me446starter/F28335Serial.c
                    // For Simulink data collection just send most current value
                    // Simulink Sample rate needs to be at best 500HZ but 200Hz or slower probably better
                    SIMU_Var1_toSIMU_32bit = 10000*Simulink_PlotVar1;
                    SIMU_Var2_toSIMU_32bit = 10000*Simulink_PlotVar2;

                    SIMU_Var3_toSIMU_32bit = 10000*Simulink_PlotVar3;
                    SIMU_Var4_toSIMU_32bit = 10000*Simulink_PlotVar4;

                    SIMU_TXrawbytes[3] = (char)((SIMU_Var1_toSIMU_32bit >> 24) & 0xFF);
                    SIMU_TXrawbytes[2] = (char)((SIMU_Var1_toSIMU_32bit >> 16) & 0xFF);
                    SIMU_TXrawbytes[1] = (char)((SIMU_Var1_toSIMU_32bit >> 8) & 0xFF);
                    SIMU_TXrawbytes[0] = (char)((SIMU_Var1_toSIMU_32bit) & 0xFF);

                    SIMU_TXrawbytes[7] = (char)((SIMU_Var2_toSIMU_32bit >> 24) & 0xFF);
                    SIMU_TXrawbytes[6] = (char)((SIMU_Var2_toSIMU_32bit >> 16) & 0xFF);
                    SIMU_TXrawbytes[5] = (char)((SIMU_Var2_toSIMU_32bit >> 8) & 0xFF);
                    SIMU_TXrawbytes[4] = (char)((SIMU_Var2_toSIMU_32bit) & 0xFF);

                    SIMU_TXrawbytes[11] = (char)((SIMU_Var3_toSIMU_32bit >> 24) & 0xFF);
                    SIMU_TXrawbytes[10] = (char)((SIMU_Var3_toSIMU_32bit >> 16) & 0xFF);
                    SIMU_TXrawbytes[9] = (char)((SIMU_Var3_toSIMU_32bit >> 8) & 0xFF);
                    SIMU_TXrawbytes[8] = (char)((SIMU_Var3_toSIMU_32bit) & 0xFF);

                    SIMU_TXrawbytes[15] = (char)((SIMU_Var4_toSIMU_32bit >> 24) & 0xFF);
                    SIMU_TXrawbytes[14] = (char)((SIMU_Var4_toSIMU_32bit >> 16) & 0xFF);
                    SIMU_TXrawbytes[13] = (char)((SIMU_Var4_toSIMU_32bit >> 8) & 0xFF);
                    SIMU_TXrawbytes[12] = (char)((SIMU_Var4_toSIMU_32bit) & 0xFF);


                    serial_sendSCIB(&SerialB,SIMU_TXrawbytes,16);

                }
            }
        } else {    // Filling data
            if (SIMU_Tranaction_Type == 2) {
                if (SIMU_datacollect == 0){
                    SIMU_databyte1 = RXBdata;
                    SIMU_datacollect++;
                }else if (SIMU_datacollect == 1){

                    SIMU_Var1_fromSIMU_16bit = ((int)RXBdata)<<8 | SIMU_databyte1;

                    SIMU_datacollect++;
                } else if (SIMU_datacollect == 2){
                    SIMU_databyte1 = RXBdata;
                    SIMU_datacollect++;
                }else if (SIMU_datacollect == 3){

                    SIMU_Var2_fromSIMU_16bit = ((int)RXBdata)<<8 | SIMU_databyte1;

                    SIMU_datacollect++;
                } else if (SIMU_datacollect == 4){
                    SIMU_databyte1 = RXBdata;
                    SIMU_datacollect++;
                }else if (SIMU_datacollect == 5){

                    SIMU_Var3_fromSIMU_16bit = ((int)RXBdata)<<8 | SIMU_databyte1;
                    SIMU_datacollect++;
                } else if (SIMU_datacollect == 6){
                    SIMU_databyte1 = RXBdata;
                    SIMU_datacollect++;
                }else if (SIMU_datacollect == 7){

                    SIMU_Var4_fromSIMU_16bit = ((int)RXBdata)<<8 | SIMU_databyte1;
                    SIMU_datacollect++;

                } else if (SIMU_datacollect == 8){
                    SIMU_databyte1 = RXBdata;
                    SIMU_datacollect++;
                }else if (SIMU_datacollect == 9){

                    SIMU_Var5_fromSIMU_16bit = ((int)RXBdata)<<8 | SIMU_databyte1;
                    SIMU_datacollect++;
                } else if (SIMU_datacollect == 10) {
                    SIMU_databyte1 = RXBdata;
                    SIMU_datacollect++;
                } else if (SIMU_datacollect == 11) {
                    SIMU_Var6_fromSIMU_16bit = ((int)RXBdata)<<8 | SIMU_databyte1;
                    SIMU_datacollect++;
                } else if (SIMU_datacollect == 12) {
                    SIMU_databyte1 = RXBdata;
                    SIMU_datacollect++;
                }else if (SIMU_datacollect == 13) {
                    SIMU_Var7_fromSIMU_16bit = ((int)RXBdata)<<8 | SIMU_databyte1;

                    SIMU_beginnewdata = 0;  // Reset the flag
                    SIMU_datacollect = 0;   // Reset the number of chars collected
                    SIMU_Tranaction_Type = 0;
                }

            }
        }
        numRXB ++;
    }

    ScibRegs.SCIFFRX.bit.RXFFINTCLR = 1;
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;
}


// for SerialC
#ifdef _FLASH
#pragma CODE_SECTION(RXCINT_recv_ready, ".TI.ramfunc");
#endif
__interrupt void RXCINT_recv_ready(void)
{
    RXCdata = ScicRegs.SCIRXBUF.all;

    /* SCI PE or FE error */
    if (RXCdata & 0xC000) {
        ScicRegs.SCICTL1.bit.SWRESET = 0;
        ScicRegs.SCICTL1.bit.SWRESET = 1;
        ScicRegs.SCIFFRX.bit.RXFIFORESET = 0;
        ScicRegs.SCIFFRX.bit.RXFIFORESET = 1;
    } else {
        RXCdata = RXCdata & 0x00FF;
        numRXC ++;

    }

    ScicRegs.SCIFFRX.bit.RXFFINTCLR = 1;
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP8;
}




// SerialA only setup for Tera Term connection
char serial_printf_bufSCIA[BUF_SIZESCIA];

uint16_t serial_printf(serialSCIA_t *s, char *fmt, ...)
{
    va_list ap;

    va_start(ap,fmt);
    vsprintf(serial_printf_bufSCIA,fmt,ap);
    va_end(ap);

    return serial_sendSCIA(s,serial_printf_bufSCIA,strlen(serial_printf_bufSCIA));
}



